---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctSizeIterator.CurrentObject
source: html/af1be077-44d7-a72c-6010-3eb8280c54bc.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSizeIterator.CurrentObject Property

## Syntax (C#)
```csharp
internal Object CurrentObject { get; }
```